newwms_gift/src/Documents/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка</name>
  <registerRecords>InformationRegister.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка</registerRecords>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйАссортиметныйУчасток</name>
    <type>
      <types>CatalogRef.ит_WMS_АссортиментныеУчасткиСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка/Forms/ФормаПодбора/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивНоменклатурыИсключения=новый Массив;
	Организация=Справочники.Организации.ПустаяСсылка();
	Если Параметры.Свойство("МассивНоменклатурыИсключения") Тогда 
		МассивНоменклатурыИсключения=Параметры.МассивНоменклатурыИсключения;
	КонецЕсли;	
	Если Параметры.Свойство("Организация") Тогда 
		Организация=Параметры.Организация;
	КонецЕсли;
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("МассивНоменклатурыИсключения",МассивНоменклатурыИсключения);
	УстановитьНоменклатуруИсключенияПодбора();
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
	
КонецПроцедуры
&НаКлиенте
Процедура СписокНоменклатурыИерархическийПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокНоменклатурыИерархический.ТекущиеДанные=Неопределено Тогда
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии","");
	иначе
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ЭлементИерархии",Элементы.СписокНоменклатурыИерархический.ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	для Каждого Строка из Элементы.СписокНоменклатуры.ВыделенныеСтроки цикл
		ДанныеСтроки=Элементы.СписокНоменклатуры.ДанныеСтроки(Строка);
		Корзина.Добавить().Номенклатура=ДанныеСтроки.Ссылка;
	КонецЦикла;
	УстановитьНоменклатуруИсключенияПодбора();
	Элементы.СписокНоменклатуры.ВыделенныеСтроки.Очистить();
КонецПроцедуры
&НаКлиенте
Процедура СписокНоменклатурыПослеУдаления(Элемент)
		УстановитьНоменклатуруИсключенияПодбора();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаПослеУдаления(Элемент)
УстановитьНоменклатуруИсключенияПодбора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд
&НаСервере
Функция  ЗавершитьВыборНаСервере()
	Возврат Корзина.Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	ОповеститьОВыборе(ЗавершитьВыборНаСервере());
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьНоменклатуруИсключенияПодбора()
	МассивНоменклатурыВКорзине=Корзина.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("МассивНоменклатурыВКорзине",МассивНоменклатурыВКорзине);
КонецПроцедуры






#КонецОбласти
